## Handling Missing Values

In [1]:
import pandas as pd 
import numpy as np

In [ ]:
1. Detect Null/Misssing Values
2. Fill Null Values
3. Drop Null Values Column

In [ ]:
1. df.isnull()
   df.isnull().sum()
2. df.isna()
   df.isna().sum()
3. df.fillna() # inplace=True
4. df.dropna() #Dropping rows
5. df.drop()   # Dropping Columns

In [ ]:
df.min()
df.max()
df.mean()
df.median()
stats.mode()

## 1. Detect Null Values

In [ ]:
df = pd.read_csv('Emp_Records.csv')
df.head(10)

In [2]:
df = pd.read_csv('Emp_Records2.csv')
df.head(10)

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,677509,Lois,36.36,60.0,13.68,168251.0,Denver
1,940761,Brenda,47.02,60.0,9.01,51063.0,Stonewall
2,428945,Joe,54.15,NaN,0.98,50155.0,Michigantown
3,408351,Diane,NaN,51.0,NaN,180294.0,Hydetown
4,193819,Benjamin,40.31,NaN,NaN,117642.0,Fremont
5,499687,Patrick,NaN,58.0,NaN,72305.0,Macksburg
6,539712,Nancy,22.14,50.0,0.87,98189.0,Atlanta
7,380086,Carol,NaN,NaN,NaN,NaN,Blanchester
8,477616,Frances,58.18,42.0,23.27,121587.0,Delmita
9,162402,Diana,29.73,60.0,3.44,43010.0,Eureka Springs

In [3]:
df.isnull() # True or False

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,True,False,False,False
3,False,False,True,False,True,False,False
4,False,False,False,True,True,False,False
...,...,...,...,...,...,...,...
95,False,False,False,False,False,False,False
96,False,False,False,False,False,False,False
97,False,False,False,False,False,False,False
98,False,False,False,False,False,False,False
99,False,False,False,False,False,False,False

In [4]:
df.isnull().sum()

Emp ID            0
First Name        0
Age in Yrs        3
Weight in Kgs     3
Age in Company    4
Salary            1
City              0
dtype: int64

In [5]:
df.isna()

,Emp ID,First Name,Age in Yrs,Weight in Kgs,Age in Company,Salary,City
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,True,False,False,False
3,False,False,True,False,True,False,False
4,False,False,False,True,True,False,False
...,...,...,...,...,...,...,...
95,False,False,False,False,False,False,False
96,False,False,False,False,False,False,False
97,False,False,False,False,False,False,False
98,False,False,False,False,False,False,False
99,False,False,False,False,False,False,False

In [6]:
df.isna().sum()

Emp ID            0
First Name        0
Age in Yrs        3
Weight in Kgs     3
Age in Company    4
Salary            1
City              0
dtype: int64

In [ ]:
df.info()

## 2. Fill Missing Values

In [ ]:
df.fillna(value, inplace = True)

In [ ]:
df.head()

In [ ]:
df1 = df.fillna(1000)
df1.head(10)

In [ ]:
df['Age in Yrs'] = df['Age in Yrs'].fillna(2000)
df.head()

In [ ]:
df.isna().sum()

In [ ]:
df = pd.read_csv('Emp_Records2.csv')
df.head(10)

In [ ]:
df.isna().sum()

In [ ]:
df['Age in Yrs'].mean()

In [ ]:
df['Age in Yrs'] = df['Age in Yrs'].fillna(df['Age in Yrs'].mean())
df.head()

In [ ]:
df['Weight in Kgs'].mean()

In [ ]:
df['Weight in Kgs'] = df['Weight in Kgs'].fillna(df['Weight in Kgs'].mean())
df.head()

In [ ]:
df = pd.read_csv('Emp_Records2.csv')
df1 = df.copy()
df.head(10)

In [ ]:
mean_wt = df['Weight in Kgs'].mean()
med_wt  = df['Weight in Kgs'].median()
print(mean_wt)
print(med_wt)

In [ ]:
df1['Weight in Kgs'] = df1['Weight in Kgs'].fillna(mean_wt)
df1.head(10)

In [ ]:
from scipy import stats
stats.mode(df['Weight in Kgs'])

In [ ]:
df1['Age in Yrs'].fillna(df1['Age in Yrs'].mean(),inplace=True)
df1.head(10)

In [ ]:
stats.mode(df1['City'])

In [ ]:
df = pd.read_csv('Emp_Records2.csv')
df1 = df.copy()
df.head(10)

In [ ]:
df['City'] = df['City'].fillna(df['City'].mode())
df.head()

In [ ]:
df['City'].mode()

In [ ]:
df = pd.read_csv('Emp_Records2.csv')
df1 = df.copy()
df.head(10)

## dropna

In [ ]:
df.isna().sum()

In [ ]:
df.dropna().head()

In [ ]:
df.shape

In [ ]:
df.dropna(thresh=6) # In a row if there are 6 Non Null values, that row will not be deleted

In [ ]:
df1.head(10)

In [ ]:
df.dropna(thresh=5) # In a row if there are 5 Non Null values, that row will not be deleted

In [ ]:
df2 = df1[:11]
df2

In [ ]:
df2.isna().sum()

In [ ]:
df2.dropna(thresh=7)

In [ ]:
df2.dropna(thresh=6)

In [ ]:
df2.dropna(thresh=5)

In [ ]:
df2

In [ ]:
df2.dropna(thresh=11,axis=1)

In [ ]:
df2.dropna(thresh=10,axis=1)

In [ ]:
df2.dropna(thresh=8,axis=1)

In [ ]:
df1.dropna(thresh=100,axis=1)

In [ ]:
df1.drop(['Age in Yrs'],axis=1,inplace=True)

In [ ]:
df1

In [ ]:
df1.drop(1,axis=0)

In [ ]:
df1.drop(['Salary','Age in Company'],axis=1)

In [ ]:
df1= df.copy()
df1

In [ ]:
df1.drop(['Emp ID','First Name','City'],axis=1,inplace=True)
df1

In [ ]:
df1

In [ ]:
df1.drop(1:5,axis=0)

In [ ]:
df1.drop(1,axis=0)

## replace()

In [ ]:
df = pd.read_csv('Emp_Records2.csv')
df1 = df.copy()
df.head(10)

In [ ]:
df['Emp ID'].nunique()

In [ ]:
df['First Name'].value_counts()

In [ ]:
df.replace({'Denver':'Mumbai','Lois':'John'},inplace=True)

In [ ]:
df.replace({60:100,np.nan:300},inplace=True)
df

In [ ]:
df['Emp ID'].replace({940761:9876543456},inplace=True)
df

In [ ]:
df.filter(regex='Sal|Age')

In [ ]:
df1['Age in Yrs'].quantile(0.25)

In [ ]:
df1['Age in Yrs'].quantile(0.5)

In [ ]:
df1['Age in Yrs'].quantile(0.75)

In [ ]:
df1['Age in Yrs'].quantile(0.95)

In [ ]:
df1['Age in Yrs'].quantile(0.99)

In [ ]:
df1